function [azimuth,elevation,r_e]=sph_r(e,s)
% 平面方程
A1=0.3893;B1=0.3893;C1=1;D1=-0.3043;
A2=1;B2=0;C2=0;D2=-0.39088;
A3=0;B3=1;C3=0;D3=-0.39088;
e1=fun3(e);
s1=fun3(s);
flag1=0;
flag2=0;
flag3=0;
% 先求出该向量e和各个面的交点，再判断交点在不在多面体上，在哪个多面体上就置相应标志位
M1 = fun1(A1,B1,C1,D1,e1,s1);
if (M1(1)<=0.39088 && M1(1)>=0 && M1(2)<=0.39088 && M1(2)>=0 && M1(3)<=0.3043 && M1(3)>=0)
    flag1=1;
end

if(dot([A2;B2;C2],e1)>1e-5)
    M2 = fun1(A2,B2,C2,D2,e1,s1);
    if (0.39088*M2(3)+0.1521*M2(2)-0.39088*0.1521<0 && M2(2)<0.39088 && M2(2)>=0 && M2(3)<0.1521 && M2(3)>=0)
        flag2=1;
    end
end

if(dot([A3;B3;C3],e1)>1e-5)
    M3 = fun1(A3,B3,C3,D3,e1,s1);
    if (M3(1)<0.39088 && M3(1)>=0 && 0.39088*M3(3)+0.1521*M3(1)-0.39088*0.1521<0 && M3(3)<0.1521 && M3(3)>=0)
        flag3=1;
    end
end

if flag1
    [~,~,r_m] = cart2sph(M1(1),M1(2),M1(3));    
end
if flag2
    [~,~,r_m] = cart2sph(M2(1),M2(2),M2(3));
end
if flag3
    [~,~,r_m] = cart2sph(M3(1),M3(2),M3(3));
end
[azimuth,elevation,~]=
end